src/DataProcessors/InitialDemobasePopulation.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.2">
	<DataProcessor>
		<Properties>
			<Name>InitialDemobasePopulation</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

src/InformationRegisters/BankTransactions.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.2">
	<InformationRegister>
		<Properties>
			<Name>BankTransactions</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Description</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Amount</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>17</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Category</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.ChartOfAccounts</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Document</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.BankTransfer</v8:Type>
						<v8:Type>cfg:DocumentRef.GeneralJournalEntry</v8:Type>
						<v8:Type>cfg:DocumentRef.Deposit</v8:Type>
						<v8:Type>cfg:DocumentRef.Check</v8:Type>
						<v8:Type>cfg:DocumentRef.PurchaseInvoice</v8:Type>
						<v8:Type>cfg:DocumentRef.CashReceipt</v8:Type>
						<v8:Type>cfg:DocumentRef.InvoicePayment</v8:Type>
						<v8:Type>cfg:DocumentRef.SalesInvoice</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Accepted</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Hidden</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>OriginalID</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>YodleeTransactionID</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Class</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Classes</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Project</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Projects</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>CheckNumber</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>SimpleDescription</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>MerchantName</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>PostDate</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Price</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>17</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Quantity</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>RunningBalance</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>17</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CurrencyCode</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>3</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CategoryID</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Type</Name>
					<Comment>Credit/Debit</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CategorizedCompanyNotAccepted</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CategorizedCategoryNotAccepted</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>OrderID</Name>
					<Comment>Sorts transactions within a day</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Imported</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>TransactionDate</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>BankAccount</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.BankAccounts</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Company</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Companies</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ID</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/DataProcessors/InitialDemobasePopulation/Ext/ObjectModule.bsl
&AtServer
Procedure AddSampleBankTransactions(BankAccount, DateStart=Undefined, DateEnd=Undefined) Export
	SetPrivilegedMode(True);
	BeginTransaction(DataLockControlMode.Managed);
	Try
		
		SessionDate	= CurrentSessionDate();
		If DateStart = Undefined Then
			DateStart = BegOfDay(AddMonth(SessionDate, -1));
		EndIf;
		If DateEnd = Undefined Then
			DateEnd = BegOfDay(SessionDate);
		EndIf;
		ArrayOfIncomingDescriptions = New Array;
		ArrayOfIncomingDescriptions.Add(New Structure("Description, Category", "ACH_STRIPE TRANSFER", 32));
		ArrayOfIncomingDescriptions.Add(New Structure("Description, Category", "Transfer from Checking", 28));
		ArrayOfIncomingDescriptions.Add(New Structure("Description, Category", "Payment for services", 94));
		ArrayOfIncomingDescriptions.Add(New Structure("Description, Category", "Bank interest", 96));
		ArrayOfOutcomingDescriptions = New Array;
		ArrayOfOutcomingDescriptions.Add(New Structure("Description, Category", "Transfer to Checking", 28));
		ArrayOfOutcomingDescriptions.Add(New Structure("Description, Category", "Fee", 24));
		ArrayOfOutcomingDescriptions.Add(New Structure("Description, Category", "Fruits & Groceries Co", 10));
		ArrayOfOutcomingDescriptions.Add(New Structure("Description, Category", "Payment to the service provider", 16));
		NumberOfDays = Round((DateEnd - DateStart)/(24*3600));
		RNG = New RandomNumberGenerator();
		For i = 0 To NumberOfDays Do
			NumberOfIncomings = RNG.RandomNumber(0, 3);
			NumberOfOutcomings = RNG.RandomNumber(0, 3);
			TransactionDate = DateStart + i * 24 * 3600; 
			For NI = 1 To NumberOfIncomings Do
				CreateBankTransaction(BankAccount, TransactionDate, TRUE, ArrayOfIncomingDescriptions, ArrayOfOutcomingDescriptions, RNG);
			EndDo;
			For NI = 1 To NumberOfOutcomings Do
				CreateBankTransaction(BankAccount, TransactionDate, FALSE, ArrayOfIncomingDescriptions, ArrayOfOutcomingDescriptions, RNG);
			EndDo;		
		EndDo;
	
		CommitTransaction();
		WriteLogEvent(
			"Infobase.PrimaryDemobasePopulation",
			EventLogLevel.Information,
			,
			,
			"Sample bank transactions for the Demo were created successfully.");
	Except
		ErrorDescription = ErrorDescription();
		If TransactionActive() Then
			RollbackTransaction();
		EndIf;
		WriteLogEvent(
			"Infobase.PrimaryDemobasePopulation",
			EventLogLevel.Error,
			,
			,
			"Creation of sample bank transactions for the Demo failed. Reason:" + ErrorDescription);
	EndTry;
		
EndProcedure

&AtServer
Procedure CreateBankTransaction(BankAccount, TransactionDate, IsIncoming, IncomingDescriptions, OutcomingDescriptions, RNG)
	RecordSet = InformationRegisters.BankTransactions.CreateRecordSet();
	NewID = New UUID();
	RecordSet.Filter.ID.Set(NewID);
	NewRecord = RecordSet.Add();
	NewRecord.ID = NewID;
	NewRecord.TransactionDate = TransactionDate;
	NewRecord.BankAccount = BankAccount;
	If IsIncoming Then
		NewRecord.Amount = RNG.RandomNumber(1, 100)*10;
		InDesc = IncomingDescriptions[RNG.RandomNumber(0,3)];
		NewRecord.Description = InDesc.Description;
		NewRecord.CategoryID = InDesc.Category;
	Else
		NewRecord.Amount = -1 * RNG.RandomNumber(1, 100)*10;
		OutDesc = OutcomingDescriptions[RNG.RandomNumber(0,3)];
		NewRecord.Description = OutDesc.Description;
		NewRecord.CategoryID = OutDesc.Category;
	EndIf;	
	RecordSet.Write = True;
	RecordSet.Write();
EndProcedure
